tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'homebrew/cask'

# Dev Essentials
brew 'git'
brew 'neovim'
brew 'fish'
cask 'visual-studio-code'
cask 'iterm2'
cask 'tower'
cask 'paw'
mas  'Kaleidoscope', id: 587512244

# Node.js
brew 'nodenv'
brew 'node-build'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Android
cask 'android-studio'

# Dev Utilities
brew 'ripgrep'
brew 'tree'
brew 'watchman'
brew 'awscli'
cask 'virtualbox'
cask 'docker'
cask 'postico'
mas 'Base', id: 402383384
brew 'xcenv'

# Productivity
mas  'Pages', id: 409201541
mas  'Keynote', id: 409183694
mas  'Numbers', id: 409203825
mas  'MindNode', id: 1289197285
mas  'Marked 2', id: 890031187
mas  'iA Writer', id: 775737590
mas  'Bear', id: 1091189122
mas  'Things3', id: 904280696
mas 'Fantastical - Calendar & Tasks', id: 975937182

# Design Tools
cask 'sketch'
cask 'imageoptim'
cask 'abstract'
mas  'xScope', id: 889428659
mas  'Pixelmator Pro', id: 1289583905

# Internet
mas 'Twitter', id: 1482454543
mas  'Reeder 4', id: 1449412482
mas  'Trello', id: 1278508951
mas  'Slack', id: 803453959
cask 'discord'
cask 'transmission'
cask 'zoomus'

# Utilities
cask 'launchbar'
mas 'Amphetamine', id: 937984704
cask 'licecap'
mas  '1Blocker', id: 1107421413
mas  '1Password 7', id: 1333542190
mas  'PCalc', id: 403504866
mas  'Screens 4', id: 1224268771
mas  'The Archive Browser', id: 510232205
mas  'The Unarchiver', id: 425424353
